package lab3;

import lab3.manager.MenuManager;

public class Main {
    public static void main(String[] args) {
        System.out.println("hello");
        MenuManager menu = new MenuManager();
        menu.start();
    }
}

/*
Вхідна інформація для виконання повинна бути зчитана з текстового файлу.
Колекція повинна зберігати початковий порядок файлу. Виконання завдання продемонструвати в основній програмі з використанням меню.
Для розв’язування задач користуватись готовими методами.
Обґрунтувати використання тих, чи інших структур та класів, які будуть використані в програмі.

                                Індивідуальне завдання

Задано інформацію про викладачів, яка включає
    прізвище,
    назву курсу та
    список студентів, що зараховані слухачами на заданий курс.

1.	Створити таблицю, в першій колонці якої є прізвище студента, а в другій – перелік дисциплін, які він слухає.
2.	Створити список студентів, які зараховані на всі дисципліни. Визначити спільних слухачів 2 заданих курсів
3.	З 2 різних файлів зчитати 2 вихідні набори інформації про викладачів. Створити спільну колекцію,
    яка складатиметься з усіх викладачів, які мають кількість курсів вищу, від середньої по узагальненій колекції, без повторів.
 */
